[
    {
        "commenter": "Swathi Rapolu",
        "comments": "When my hubby n I were looking for a K.G for our child, we want her frst experience to be in a<br />loving, caring n homely environment where they receive professional care n feel safe, we found<br />all those qualities at (K.E.S)Jagadeeswari School of Learning where the English language environment<br />was an Xtra gift for us!<br />Now our child can speak 2 languages and HAPPY☺️☺️n SELF CONFIDENT.<br />ThanQ for offering such a great K.G with so many activities n real great teachers.<br />my daughter&nbsp;❤ SAI SRINIDHI likes it a lot n so do we.<br />From my bottom of the heart I can say K.E.S is the best in all respects<br />We would like to ThanQ n your staff for their help in preparing n organising a very gud bday<br />party.&nbsp;most important the kids really enjoyed the games and had very good time .<br />we would like to ThanQ for ur professional n eductional K.G which is surrounded by a happy n<br />caring atmosphere<br />We r sure that my kid will never forget all the happy times she had at K.E.S and so won&amp;#39;t we.<br />We wish u all the rewards u bring to many and all d best for the future.<br />I will gladly recommend K.E.S to other parents who would like to do something very special.<br />once again many thanks.<br />THANK YOU&nbsp;❤&nbsp;PAVANI MAM. I really mean it❤️"
    },
    {
        "commenter": "Pakali Srinivas",
        "comments": "Hi I am Pakali Srinivas { M.com &nbsp;D.Ed MR,B.Ed MR} Edify had set-up nice inclusive education<br />system to group the students with special need children; its gives an opportunity to special<br />children to interact with their fellow classmates as well as bond and learn from them. Edify giving<br />better quality of education and they are trying hard to develop academic, personal, social,<br />occupational and recreational skills. It helps a lot to special child to work independently.and<br />School environment is barrier free environment to special children and specially Pavani madam<br />dealing with students....no words to explain."
    },
    {
        "commenter": "Sreeharika K",
        "comments": "<p>I can definitely say that this is the best and unique school for kids of today's generation..<br />They not only teach academics, but also teach ethics and moral values to students.. <br /><br />The director of the school (Pavani ma'am) will treat each and every student as her own child..<br /> Teachers are also very friendly with students..</p>"
    },
    {
        "commenter": "Ajay Prabha",
        "comments": " <p>Dear all are you looking for a place where your child gets overall learning with moral values Jagadeeswari School of Learning is the place where can join without any doubt. And management encouraging challenging children by providing inclusive setup. Thank you Dr. Pavani Byreeka who is comforting child in all aspects by allowing kid calling as &#39;ATTA&#39;</p>"
    },
    {
        "commenter": "Purushotham Vishwakarma",
        "comments": "<p>Suparb...this is the best school for kids..... really exlent</p>"
    }
]